lib_app/app/controllers/libraries_controller.rb

  def index
    @libraries = Library.all
---
SELECT "libraries".* FROM "libraries"